## PR1

1. Selecciona las filas del DataFrame 'destino' que cumplan que el dato en la columna 'float_col' sea > que 10.
2. ¿Qué ocurre con los valores NaN?
3. Renombra las columnas

In [1]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'int_col' : [1,2,6,8,-1],               
                   'float_col' : [0.1, 0.2,0.2,10.1,None], 
                   'str_col' : ['a','b',None,'c','a']})    
                                                        
destino = df.reindex([4,2,3,1,0, 5, 6], fill_value = 99)
destino = destino.reindex( columns= [ 'Nuevo Valor 2','float_col', 'Nuevo Valor 1'])
destino

   Nuevo Valor 2  float_col  Nuevo Valor 1
4            NaN        NaN            NaN
2            NaN        0.2            NaN
3            NaN       10.1            NaN
1            NaN        0.2            NaN
0            NaN        0.1            NaN
5            NaN       99.0            NaN
6            NaN       99.0            NaN

In [97]:
# Sol:

destino[destino.loc[:,'float_col'] > 10]
destino.columns = ['Nuevo Valor 2','Importe', 'Nuevo Valor 1']
destino

   Nuevo Valor 2  Importe  Nuevo Valor 1
4            NaN      NaN            NaN
2            NaN      0.2            NaN
3            NaN     10.1            NaN
1            NaN      0.2            NaN
0            NaN      0.1            NaN
5            NaN     99.0            NaN
6            NaN     99.0            NaN

## PR2

La hoja de cálculo [resumen_contable.xlsx](./datos/resumen_contable.xlsx) recoge los gastos e ingresos de distintas delegaciones de una empresa.
El siguiente código crea los dataFrames asociados a cada una de las delegaciones.

In [38]:
from pandas import ExcelFile
resumen = pd.ExcelFile('./datos/resumen_contable.xlsx')
Valencia = resumen.parse(0,  skiprows=1 )     # datos de la primera hoja
Sevilla = resumen.parse(1,  skiprows=1 )   
Galicia = resumen.parse(2,  skiprows=1 )

Se pretende unificar todos los datos de forma que tengamos un resumen de gastos e ingresos anual de toda la empresa.

__Posible Solución:__

In [99]:
m = pd.merge(Sevilla, Valencia, on = 'Year', how= 'outer')
m

   Year  Gastos_x  Ingresos_x  Gastos_y  Ingresos_y
0  2000      1000        5000      4000        8000
1  2002      5000        5000       NaN         NaN
2  2005      2500        3000      2154        3000
3  2006      6000        7000      5201        1000
4  2008      2500        1500       NaN         NaN
5  2001       NaN         NaN      3000        5000
6  2007       NaN         NaN      2000        1000
7  2010       NaN         NaN      9000        2000

In [34]:
m['nueva_g'] = m.loc[:, 'Gastos_x'] + m.loc[:, 'Gastos_y']
m

   Year  Gastos_x  Ingresos_x  Gastos_y  Ingresos_y  nueva_g
0  2000      1000        5000      4000        8000     5000
1  2002      5000        5000       NaN         NaN      NaN
2  2005      2500        3000      2154        3000     4654
3  2006      6000        7000      5201        1000    11201
4  2008      2500        1500       NaN         NaN      NaN
5  2001       NaN         NaN      3000        5000      NaN
6  2007       NaN         NaN      2000        1000      NaN
7  2010       NaN         NaN      9000        2000      NaN

In [35]:
# Sol:
# teniendo en cuenta que pandas realiza alineamiento de datos:
from pandas import ExcelFile
resumen = pd.ExcelFile('./datos/resumen_contable.xlsx')
Valencia = resumen.parse(0,index_col = [0],  skiprows=1 )     # datos de la primera hoja
Sevilla = resumen.parse(1, index_col = [0], skiprows=1 )   
Galicia = resumen.parse(2, index_col = [0], skiprows=1 )   

Sevilla.add(Valencia, fill_value = 0)

      Gastos  Ingresos
Year
2000    5000     13000
2001    3000      5000
2002    5000      5000
2005    4654      6000
2006   11201      8000
2007    2000      1000
2008    2500      1500
2010    9000      2000

## PR3

El fichero [quakes.csv](./datos/quakes.csv) recoge los datos de observaciones de movimientos sísmicos de magnitud superior a 4 en la escala de Richter  en un sector de la ciudad de Fiji desde 1964. 

1. Mostrar todos los datos con un único decimal. Para ello aplica la función __applymap__ .

In [88]:
tabla_sismicos = pd.read_csv('./datos/quakes.csv', 
     names = ['Latitud', 'Longitud', 'Profundidad','Magnitud', 'Estaciones'] )
tabla_sismicos.head()

   Latitud Longitud  Profundidad  Magnitud  Estaciones
1   -20.42   181.62          562       4.8          41
2   -20.62   181.03          650       4.2          15
3   -26.00        -           42       5.4          43
4   -17.97   181.66          626       4.1          19
5   -20.42   181.96          649       4.0          11

In [89]:
# Sol:
formato = lambda x: '%.1f' % x
def n(x):
    return float(x) if x != '-' else 0

t = tabla_sismicos.applymap(n)    # aplica la función a cada elemento de la tabla
t.head()

   Latitud  Longitud  Profundidad  Magnitud  Estaciones
1   -20.42    181.62          562       4.8          41
2   -20.62    181.03          650       4.2          15
3   -26.00      0.00           42       5.4          43
4   -17.97    181.66          626       4.1          19
5   -20.42    181.96          649       4.0          11

In [90]:
# Sol:
formato = lambda x: '%.1f' % x
t = t.head().applymap(formato)    # aplica la función a cada elemento de la tabla
t.head()

  Latitud Longitud Profundidad Magnitud Estaciones
1   -20.4    181.6       562.0      4.8       41.0
2   -20.6    181.0       650.0      4.2       15.0
3   -26.0      0.0        42.0      5.4       43.0
4   -18.0    181.7       626.0      4.1       19.0
5   -20.4    182.0       649.0      4.0       11.0

## PR4

El fichero [quakes.csv](./datos/quakes.csv) recoge los datos de observaciones de movimientos sísmicos de magnitud superior a 4 en la escala de Richter  en un sector de la ciudad de Fiji desde 1964. 

1. Crea un DataFrame con los datos del fichero como has hecho en PR3. En la creación del DataFrame utiliza la opción __na_values__ para  indicar que los valores '-' en la columna __Longitud__ se carguen como NaN.
2. Sustituye todos los valores NaN por 0.

In [103]:
# Sol:
tabla_sismicos = pd.read_csv('./datos/quakes.csv', 
     names = ['Latitud', 'Longitud', 'Profundidad','Magnitud', 'Estaciones'],
     na_values = {'Longitud': ['-']})


tabla_sismicos.fillna(0).head()

   Latitud  Longitud  Profundidad  Magnitud  Estaciones
1   -20.42    181.62          562       4.8          41
2   -20.62    181.03          650       4.2          15
3   -26.00      0.00           42       5.4          43
4   -17.97    181.66          626       4.1          19
5   -20.42    181.96          649       4.0          11

## PR5

1. Calcular el total de comensales por día de la semana.
2. Dibujar el diagrama de barras con el resultado anterior.

In [104]:
from pandas import crosstab
tips = pd.read_csv('./datos/tips.csv',
                   skiprows = 1,
                   names = ['Importe_Factura', 'Propina', 'Sexo', 'Fumador', 'Dia',
                              'Tipo', 'Comensales']
                          )
frecuencias = pd.crosstab(tips.Dia, tips.Comensales)
frecuencias

Comensales  1   2   3   4  5  6
Dia
Fri         1  16   1   1  0  0
Sat         2  53  18  13  1  0
Sun         0  39  15  18  3  1
Thur        1  48   4   5  1  3

In [ ]:
# Sol:
totales = frecuencias.sum(axis=1).astype(float)
totales

In [ ]:
totales.plot(kind = 'bar');